# Uso de Dataframe en Pandas
##### https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html

In [1]:
import pandas as pd
import sys
import datetime as dt
import numpy as np
import matplotlib.pyplot as plt
import matplotlib

%matplotlib inline

In [2]:
df = pd.DataFrame({'date':['17 MAY2018']})
df

         date
0  17 MAY2018

In [3]:
df['date2'] = pd.to_datetime(df['date'])

df

         date      date2
0  17 MAY2018 2018-05-17

In [4]:
mi_df = pd.read_json('data/data-demo-3.json')

In [5]:
mi_df

    nombres apellidos  edad
0      rené  elizalde    10
1   enrique     cueva     9
2    carlos  castillo    12
3     pedro   salinas    13
4  cristian   andrade    14

In [6]:
mi_df.dtypes

nombres      object
apellidos    object
edad          int64
dtype: object

In [7]:
mi_df['edad'] = mi_df['edad'].astype(float)
mi_df

    nombres apellidos  edad
0      rené  elizalde  10.0
1   enrique     cueva   9.0
2    carlos  castillo  12.0
3     pedro   salinas  13.0
4  cristian   andrade  14.0

In [8]:
mi_df = pd.read_json('data/data-demo-4.json')

In [9]:
mi_df

    nombres apellidos    edad
0      rené  elizalde  edad10
1   enrique     cueva   edad9
2    carlos  castillo  edad12
3     pedro   salinas  edad13
4  cristian   andrade  edad14

In [10]:
mi_df['edad2'] = mi_df['edad'].str.replace("edad", "").astype("int")

In [11]:
mi_df

    nombres apellidos    edad  edad2
0      rené  elizalde  edad10     10
1   enrique     cueva   edad9      9
2    carlos  castillo  edad12     12
3     pedro   salinas  edad13     13
4  cristian   andrade  edad14     14